In [1]:
import numpy  as np
import pandas as pd

##### Join based on columns
###### merge(): how = 'inner','left','right','outer' ,on=[key1,key2,...]

In [2]:
data1 = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],'year':[2000,2001,2002,2001,2002,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
data1

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [3]:
data2 = data1.copy()
data2

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [4]:
data1_df = pd.DataFrame(data1)
data2_df = pd.DataFrame(data2)

In [5]:
data1_df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [14]:
data2_df

   pop2  state2  year
0   1.5    Ohio  2000
1   1.7    Ohio  2001
2   3.6    Ohio  2002
3   2.4  Nevada  2001
4   2.9  Nevada  2002
5   3.2  Nevada  2003

In [10]:
data1_df.head()
data2_df.columns = ['pop2','state2','year']
data2_df.head()

   pop2  state2  year
0   1.5    Ohio  2000
1   1.7    Ohio  2001
2   3.6    Ohio  2002
3   2.4  Nevada  2001
4   2.9  Nevada  2002

In [11]:
pd.merge(data1_df,data2_df,how='inner',on=['year'])

   pop   state  year  pop2  state2
0  1.5    Ohio  2000   1.5    Ohio
1  1.7    Ohio  2001   1.7    Ohio
2  1.7    Ohio  2001   2.4  Nevada
3  2.4  Nevada  2001   1.7    Ohio
4  2.4  Nevada  2001   2.4  Nevada
5  3.6    Ohio  2002   3.6    Ohio
6  3.6    Ohio  2002   2.9  Nevada
7  2.9  Nevada  2002   3.6    Ohio
8  2.9  Nevada  2002   2.9  Nevada
9  3.2  Nevada  2003   3.2  Nevada

In [12]:
data1_df.merge(data2_df,how='inner',on=['year'])

   pop   state  year  pop2  state2
0  1.5    Ohio  2000   1.5    Ohio
1  1.7    Ohio  2001   1.7    Ohio
2  1.7    Ohio  2001   2.4  Nevada
3  2.4  Nevada  2001   1.7    Ohio
4  2.4  Nevada  2001   2.4  Nevada
5  3.6    Ohio  2002   3.6    Ohio
6  3.6    Ohio  2002   2.9  Nevada
7  2.9  Nevada  2002   3.6    Ohio
8  2.9  Nevada  2002   2.9  Nevada
9  3.2  Nevada  2003   3.2  Nevada

In [15]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data':range(7)})
df1

   data key
0     0   b
1     1   b
2     2   a
3     3   c
4     4   a
5     5   a
6     6   b

In [16]:
df2 = pd.DataFrame({'key':['a','b','d'],'data2':range(3)})
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [6]:
pd.merge(df1,df2)

   data key  data2
0     0   b      1
1     1   b      1
2     6   b      1
3     2   a      0
4     4   a      0
5     5   a      0

In [17]:
df1

   data key
0     0   b
1     1   b
2     2   a
3     3   c
4     4   a
5     5   a
6     6   b

In [18]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [7]:
pd.merge(df1,df2,how='inner',on=['key'])

   data key  data2
0     0   b      1
1     1   b      1
2     6   b      1
3     2   a      0
4     4   a      0
5     5   a      0

In [8]:
print(df1,df2)
pd.merge(df1,df2,on=['key'],how='left')

   data key
0     0   b
1     1   b
2     2   a
3     3   c
4     4   a
5     5   a
6     6   b    data2 key
0      0   a
1      1   b
2      2   d

   data key  data2
0     0   b    1.0
1     1   b    1.0
2     2   a    0.0
3     3   c    NaN
4     4   a    0.0
5     5   a    0.0
6     6   b    1.0

In [9]:
pd.merge(df1,df2,on=['key'],how='right')

   data key  data2
0   0.0   b      1
1   1.0   b      1
2   6.0   b      1
3   2.0   a      0
4   4.0   a      0
5   5.0   a      0
6   NaN   d      2

In [10]:
pd.merge(df1,df2,on=['key'],how='outer')

   data key  data2
0   0.0   b    1.0
1   1.0   b    1.0
2   6.0   b    1.0
3   2.0   a    0.0
4   4.0   a    0.0
5   5.0   a    0.0
6   3.0   c    NaN
7   NaN   d    2.0

In [13]:
data2 = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Texas','New York'],'year':[2000,2001,2002,2001,2002,2003,2004],'literacy':[95,98,92,93,91,95,99]}
data2

{'literacy': [95, 98, 92, 93, 91, 95, 99],
 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Texas', 'New York'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003, 2004]}

In [14]:
data1_df = pd.DataFrame(data1)
data1_df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [15]:
data2_df = pd.DataFrame(data2)
data2_df

   literacy     state  year
0        95      Ohio  2000
1        98      Ohio  2001
2        92      Ohio  2002
3        93    Nevada  2001
4        91    Nevada  2002
5        95     Texas  2003
6        99  New York  2004

In [16]:
pd.merge(data1_df,data2_df,on=['state','year'],how='inner')

   pop   state  year  literacy
0  1.5    Ohio  2000        95
1  1.7    Ohio  2001        98
2  3.6    Ohio  2002        92
3  2.4  Nevada  2001        93
4  2.9  Nevada  2002        91

In [17]:
pd.merge(data1_df,data2_df,on=['state','year'],how='left')

   pop   state  year  literacy
0  1.5    Ohio  2000      95.0
1  1.7    Ohio  2001      98.0
2  3.6    Ohio  2002      92.0
3  2.4  Nevada  2001      93.0
4  2.9  Nevada  2002      91.0
5  3.2  Nevada  2003       NaN

In [21]:
# if both dataframe does not have common column name but logically we want to merge it so use left_on, right_on
pd.merge(data1_df,data2_df,left_on=['state','year'],right_on=['state','year'],how='outer')

   pop     state  year  literacy
0  1.5      Ohio  2000      95.0
1  1.7      Ohio  2001      98.0
2  3.6      Ohio  2002      92.0
3  2.4    Nevada  2001      93.0
4  2.9    Nevada  2002      91.0
5  3.2    Nevada  2003       NaN
6  NaN     Texas  2003      95.0
7  NaN  New York  2004      99.0

##### Join based on index

In [19]:
df1,df2

(   data key
 0     0   b
 1     1   b
 2     2   a
 3     3   c
 4     4   a
 5     5   a
 6     6   b,    data2 key
 0      0   a
 1      1   b
 2      2   d)

In [22]:
pd.merge(df1,df2,left_index=True,right_index=True)

   data key_x  data2 key_y
0     0     b      0     a
1     1     b      1     b
2     2     a      2     d

In [23]:
pd.merge(df1,df2,left_index=True,right_index=True,how='left')

   data key_x  data2 key_y
0     0     b    0.0     a
1     1     b    1.0     b
2     2     a    2.0     d
3     3     c    NaN   NaN
4     4     a    NaN   NaN
5     5     a    NaN   NaN
6     6     b    NaN   NaN

In [25]:
# Mixing of column as well as index
pd.merge(df1,df2,left_on='key',right_index=True,how='outer')

  key  data key_x  data2 key_y
0   b   0.0     b    NaN   NaN
1   b   1.0     b    NaN   NaN
6   b   6.0     b    NaN   NaN
2   a   2.0     a    NaN   NaN
4   a   4.0     a    NaN   NaN
5   a   5.0     a    NaN   NaN
3   c   3.0     c    NaN   NaN
6   0   NaN   NaN    0.0     a
6   1   NaN   NaN    1.0     b
6   2   NaN   NaN    2.0     d

#### Concat
combines 2 objects along with axis

In [26]:
s1 = pd.Series([0,1],index=['a','b'])
s2 = pd.Series([2,3,4],index=['c','d','e'])
s3 = pd.Series([5,6],index=['f','g'])

In [27]:
s1,s2,s3

(a    0
 b    1
 dtype: int64, c    2
 d    3
 e    4
 dtype: int64, f    5
 g    6
 dtype: int64)

In [28]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [30]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [31]:
df1,df2

(   data key
 0     0   b
 1     1   b
 2     2   a
 3     3   c
 4     4   a
 5     5   a
 6     6   b,    data2 key
 0      0   a
 1      1   b
 2      2   d)

In [32]:
pd.concat([df1,df2],axis=1)

   data key  data2  key
0     0   b    0.0    a
1     1   b    1.0    b
2     2   a    2.0    d
3     3   c    NaN  NaN
4     4   a    NaN  NaN
5     5   a    NaN  NaN
6     6   b    NaN  NaN

In [34]:
pd.concat([df1,df2])

   data  data2 key
0   0.0    NaN   b
1   1.0    NaN   b
2   2.0    NaN   a
3   3.0    NaN   c
4   4.0    NaN   a
5   5.0    NaN   a
6   6.0    NaN   b
0   NaN    0.0   a
1   NaN    1.0   b
2   NaN    2.0   d

#### combine_first()
If there is overlap of index in 2 dataframes, we want to consider it, use combine_first() method

In [35]:
df1.combine_first(df2) # with overlap kind of union

   data  data2 key
0     0    0.0   b
1     1    1.0   b
2     2    2.0   a
3     3    NaN   c
4     4    NaN   a
5     5    NaN   a
6     6    NaN   b

### Groupby()

In [19]:
data1_df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [24]:
print(data1_df.info())
data1_df['year'] = data1_df['year'].astype('object')
data1_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
pop      6 non-null float64
state    6 non-null object
year     6 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
pop      6 non-null float64
state    6 non-null object
year     6 non-null object
dtypes: float64(1), object(2)
memory usage: 224.0+ bytes

In [26]:
data1_df.groupby(by=['state','year']).sum() # recommended way to do groupby

             pop
state  year
Nevada 2001  2.4
       2002  2.9
       2003  3.2
Ohio   2000  1.5
       2001  1.7
       2002  3.6

In [38]:
data1_df.groupby(data1_df['year']).mean()

       pop
year
2000  1.50
2001  2.05
2002  3.25
2003  3.20

In [40]:
data1_df['pop'].groupby(data1_df['year']).max()

year
2000    1.5
2001    2.4
2002    3.6
2003    3.2
Name: pop, dtype: float64

In [41]:
data1_df.groupby(data1_df['year']).max()

      pop   state
year
2000  1.5    Ohio
2001  2.4    Ohio
2002  3.6    Ohio
2003  3.2  Nevada

In [46]:
data1_df['pop'].groupby([data1_df['year'],data1_df['state']]).max()

year  state
2000  Ohio      1.5
2001  Nevada    2.4
      Ohio      1.7
2002  Nevada    2.9
      Ohio      3.6
2003  Nevada    3.2
Name: pop, dtype: float64